import 'package:flutter/material.dart';

List<GodName> names = [
  GodName("الله",
      "وهو الاسم الأعظم الذي تفرد به الحق سبحانه وخص به نفسه وجعله أول أسمائه، وأضافها كلها إليه فهو علم على ذاته سبحانه"),
  GodName("الرحمن",
      "كثير الرحمة وهو اسم مقصور على الله عز وجل ولا يجوز أن يقال رحمن لغير الله، وذلك لأن رحمته وسعت كل شيء وهو أرحم الراحمين"),
  GodName("الرحيم", "هو المنعم أبدا، المتفضل دوما، فرحمته لا تنتهي"),
  GodName("الملك",
      "هو الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق فهو المالك المطلق"),
  GodName(
      "القدوس", "هو الطاهر المنزه عن العيوب والنقائص وعن كل ما تحيط به العقول"),
  GodName("السلام",
      "هو ناشر السلام بين الأنام وهو الذي سلمت ذاته من النقص والعيب والفناء"),
  GodName("المؤمن", "هو الذي سلم أوليائه من عذابه، والذي يصدق عباده ما وعدهم"),
  GodName("المهيمن",
      "هو الرقيب الحافظ لكل شيء، القائم على خلقه بأعمالهم، وأرزاقهم وآجالهم، المسؤول عنهم بالرعاية والوقاية والصيانة"),
  GodName("العزيز",
      "هو المنفرد بالعزة، الظاهر الذي لا يقهر، القوي الممتنع فلا يغلبه شيء وهو غالب كل شيء"),
  GodName("الجبار",
      " هو الذي تنفذ مشيئته، ولا يخرج أحد عن تقديره، وهو القاهر لخلقه على ما أراد"),
  GodName("المتكبر", " هو المتعالى عن صفات الخلق المنفرد بالعظمة والكبرياء"),
  GodName("الخالق",
      "هو الفاطر المبدع لكل شيء، والمقدر له والموجد للأشياء من العدم، فهو خالق كل صانع وصنعته"),
  GodName("البارئ",
      "هو الذي خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود"),
  GodName("المصور",
      "هو الذي صور جميع الموجودات، ورتبها فأعطى كل شيء منها صورة خاصة، وهيئة منفردة، يتميز بها على اختلافها "),
  GodName("الغفار", "هو وحده الذي يغفر الذنوب ويستر العيوب في الدنيا والآخرة"),
  GodName("القهار",
      "هو الغالب الذي قهر خلقه بسلطانه وقدرته، وصرفهم على ما أراد طوعا وكرها، وخضع لجلاله كل شيء"),
  GodName("الوهاب",
      "هو المنعم على العباد، الذي يهب بغير عوض ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء"),
  GodName("الرزاق",
      "هو الذي خلق الأرزاق وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته ويصلحه"),
  GodName("الفتاح",
      "هو الذي يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض"),
  GodName("العليم",
      "هو الذي يعلم تفاصيل الأمور، ودقائق الأشياء وخفايا الضمائر، والنفوس، لا يغرب عن ملكه مثقال ذرة، فعلمه يحيط بجميع الأشياء"),
  GodName("القابض",
      "هو الذي يقبض الرزق عمن يشاء من الخلق بعدله، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط"),
  GodName("الباسط",
      "هو الذي يقبض الرزق عمن يشاء من الخلق بعدله، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط"),
  GodName("الخافض",
      "هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات وهو رافع السماوات"),
  GodName("الرافع",
      "هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات وهو رافع السماوات"),
  GodName("المعز",
      "هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله"),
  GodName("المذل",
      "هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله"),
  GodName("السميع",
      "هو الذي لا يخفى عليه شيء في الأرض ولا في السماء وهو السميع البصير"),
  GodName("البصير",
      "هو الذي يرى الأشياء كلها ظاهرها وباطنها وهو المحيط بكل شيئ علماً"),
  GodName("الحكم",
      "هو الذي يفصل بين مخلوقاته بما شاء ويفصل بين الحق والباطل لا راد لقضائه ولا معقب لحكمه"),
  GodName("العدل",
      "هو الذي حرم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه"),
  GodName("اللطيف",
      "هو البر الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم"),
  GodName("الخبير",
      "هو العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء فهو العالم بما كان ويكون"),
  GodName("الحليم",
      "هو الصبور الذي يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع"),
  GodName(
      "العظيم", "هو الذي ليس لعظمته بداية ولا لجلاله نهاية، وليس كمثله شيء"),
  GodName("الغفور", "هو الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم"),
  GodName("الشكور",
      "هو الذي يزكو عنده القليل من أعمال العباد، فيضاعف لهم الجزاء، وشكره لعباده مغفرته لهم"),
  GodName("العلى",
      "هو الرفيع القدر فلا يحيط به وصف الواصفين المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتا وقهرا وشأنا"),
  GodName("الكبير",
      "هو العظيم الجليل ذو الكبرياء في صفاته وأفعاله فلا يحتاج إلى شيء ولا يعجزه شيء (ليس كمثله شيء)"),
  GodName("الحفيظ",
      "هو الذي لا يغرب عن حفظه شيء ولو كمثقال الذر فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل"),
  GodName("المقيت",
      "هو المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد"),
  GodName("الحسيب",
      "هو الكافي الذي منه كفاية العباد وهو الذي عليه الإعتماد يكفي العباد بفضله"),
  GodName("الجليل",
      "هو العظيم المطلق المتصف بجميع صفات الكمال والمنعوت بكمالها المنزه عن كل نقص"),
  GodName("الكريم",
      "هو الكثير الخير الجواد المعطي الذي لا ينفذ عطاؤه وهو الكريم المطلق الجامع لأنواع الخير والشرف والفضائل المحمود بفعاله"),
  GodName("الرقيب",
      " هو الرقيب الذي يراقب أحوال العباد ويعلم أقوالهم ويحصي أعمالهم وهو الحافظ الذي لا يغيب عنه شيء"),
  GodName("المجيب",
      "هو الذي يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يسأل أحد سواه"),
  GodName(
      "الواسع", "هو الذي وسع رزقه جميع خلقه، وسعت رحمته كل شيء المحيط بكل شيء"),
  GodName("الحكيم",
      "هو المحق في تدبيره اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل"),
  GodName("الودود", "هو المحب لعباده، والمحبوب في قلوب أوليائه"),
  GodName("المجيد",
      "هو البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر"),
  GodName("الباعث",
      "هو باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد"),
  GodName("الشهيد",
      "هو الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله"),
  GodName("الحق", "هو الذي يحق الحق بكلماته ويؤيد أولياءه فهو المستحق للعبادة"),
  GodName("الوكيل",
      "هو الكفيل بالخلق القائم بأمورهم فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه"),
  GodName("القوي",
      "هو صاحب القدرة التامة البالغة الكمال غالب لا يغلب فقوته فوق كل قوة"),
  GodName("المتين",
      "هو الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا إلى معين"),
  GodName("الولي",
      "هو المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي الأمور الخلائق ويحفظهم"),
  GodName("الحميد", "هو المستحق للحمد والثناء، الذي لا يحمد على مكروه سواه"),
  GodName("المحصي", "هو الذي أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل"),
  GodName("المبدئ", "هو الذي أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال"),
  GodName("المعيد",
      "هو الذي يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة"),
  GodName("المحيي",
      "هو خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت"),
  GodName("المميت",
      "هو مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء"),
  GodName("الحي",
      "هو المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية فهو الباقي أزلا وأبدا وهو الحي الذي لا يموت"),
  GodName("القيوم",
      "هو القائم بنفسه، الغني عن غيره، وهو القائم بتدبير أمر خلقه في إنشائهم ورزقهم"),
  GodName("الواجد",
      "هو الذي لا يعوزه شيء ولا يعجزه شيء يجد كل ما يطلبه، ويدرك كل ما يريده"),
  GodName("الماجد",
      "هو الذي له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال الذي يعامل العباد بالجود والرحمة"),
  GodName("الواحد",
      "هو الفرد المتفرد في ذاته وصفائه وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه"),
  GodName("الصمد",
      "هو المطاع الذي لا يقضى دونه أمر، الذي يقصد إليه في الحوائج فهو مقصد عباده في مهمات دينهم ودنياهم"),
  GodName("القادر",
      "هو الذي يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدا عليه ولا ناقصا عنه"),
  GodName(
      "المقتدر", "هو الذي يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره"),
  GodName("المقدم",
      "هو الذي يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه"),
  GodName("المؤخر",
      "هو الذي يؤخر الأشياء فيضعها في مواضعها المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير"),
  GodName("الأول", "هو الذي لم يسبقه في الوجود شيء فهو أول قبل الوجود"),
  GodName("الأخر",
      "هو الباقي بعد فناء خلقه، البقاء الأبدي يفنى الكل وله البقاء وحده، فليس بعده شيء"),
  GodName(
      "الظاهر", "هو الذي ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله"),
  GodName("الباطن",
      "هو العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد"),
  GodName("الوالي",
      "هو المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه"),
  GodName("المتعال", "هو الذي جل عن إفك المفترين، وتنزه عن وساوس المتحيرين"),
  GodName("البر",
      "هو العطوف على عباده ببره ولطفه، ومن على السائلين بحسن عطائه، وهو الصدق فيما وعد"),
  GodName("التواب",
      "هو الذي يوفق عباده للتوبة حتى يتوب عليهم ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بغفران الذنوب"),
  GodName("المنتقم",
      "هو الذي يقسم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار"),
  GodName("العفو",
      "هو الذي يترك المؤاخدة على الذنوب ولا يذكرك بالعيوب فهو يمحو السيئات ويتجاوز عن المعاصي"),
  GodName("الرءوف",
      "هو المتعطف على المذنبين بالتوبة، الذي جاد بلطفه ومن بتعطفه، يستر العيوب ثم يعفو عنها"),
  GodName(
      "مالك الملك", "هو المتصرف في ملكه كيف يشاء لا راد لحكمه، ولا معقب لأمره"),
  GodName("ذو الجلال والاكرام",
      "هو المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يجل"),
  GodName("المقسط",
      "هو العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم"),
  GodName("الجامع",
      "هو الذي جمع الكمالات كلها، ذاتا ووصفا وفعلا، الذي يجمع بين الخلائق المتماثلة والمتباينة، والذي يجمع الأولين والآخرين"),
  GodName("الغني",
      "هو الذي لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه"),
  GodName("المغني",
      "هو معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده"),
  GodName(
      "المانع", "هو الذي أعطى كل شيء، ويمنع العطاء عن من يشاء ابتلاء أو حماية"),
  GodName("الضار",
      "هو المقدر للضر على من أراد كيف أراد، والمقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه"),
  GodName("النافع",
      "هو المقدر للضر على من أراد كيف أراد، والمقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه"),
  GodName("النور",
      "هو الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره"),
  GodName("الهادي",
      " هو المبين للخلق طريق الحق بكلامه يهدي القلوب إلى معرفته، والنفوس إلى طاعته"),
  GodName("البديع",
      "هو الذي لا يماثله أحد في صفاته ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال"),
  GodName("الباقي",
      "هو وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء"),
  GodName("الوارث",
      "هو الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها"),
  GodName("الرشيد",
      "هو الذي أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد"),
  GodName("الصبور",
      "هو الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر، ولا يسرع بالفعل قبل أوانه"),
];

class GodName {
  String? name;
  String? description;

  GodName(this.name, this.description);
}

List<MorningMemories> Morning = [
  MorningMemories(
      "أَعُوذُ  بِاللهِ  مِنْ  الشَّيْطَانِ  الرَّجِيمِ  \n اللّهُ  لاَ  إِلَـهَ  إِلاَّ  هُوَ  الْحَيُّ  الْقَيُّومُ  لاَ  تَأْخُذُهُ  سِنَةٌ"
          " وَلاَ  نَوْمٌ  لَّهُ  مَا  فِي  السَّمَاوَاتِ  وَمَا  فِي "
          " الأَرْضِ    مَن  ذَا  الَّذِي  يَشْفَعُ  عِنْدَهُ  إِلاَّ  بِإِذْنِهِ  يَعْلَمُ  مَا  بَيْنَ  أَيْدِيهِمْ "
          " وَمَا  خَلْفَهُمْ  وَلاَ  يُحِيطُونَ  بِشَيْءٍ  مِّنْ  عِلْمِهِ  إِلاَّ  بِمَا  شَاء  وَسِعَ  كُرْسِيُّهُ "
          "السَّمَاوَاتِ  وَالأَرْضَ   وَلاَ  يَؤُودُهُ  حِفْظُهُمَا  وَهُوَ  الْعَلِيُّ  الْعَظِيمُ . \n مرة واحدة (1)",
      "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح "),
  MorningMemories(
      "بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم\n "
          "قُلْ  هُوَ  ٱللَّهُ أَحَدٌ  ،  ٱللَّهُ  ٱلصَّمَدُ  ،  لَمْ  يَلِدْ  وَلَمْ  يُولَدْ  ،  وَلَمْ  يَكُن  لَّهُۥ  كُفُوًا  أَحَدٌۢ . \n ثلاث مرات (3)",
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)"),
  MorningMemories(
      "بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم\n "
          "قُلْ  أَعُوذُ  بِرَبِّ  ٱلْفَلَقِ  ،  مِن  شَرِّ  مَا  خَلَقَ  ،  وَمِن  شَرِّ  غَاسِقٍ  إِذَا  وَقَبَ ،  وَمِن  شَرِّ  ٱلنَّفَّٰثَٰتِ  فِى  ٱلْعُقَدِ  ،  وَمِن  شَرِّ  حَاسِدٍ  إِذَا  حَسَدَ . \n ثلاث مرات (3)",
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)"),
  MorningMemories(
      "بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم\n "
          "قُلْ  أَعُوذُ  بِرَبِّ  ٱلنَّاسِ  ،  مَلِكِ  ٱلنَّاسِ  ،  إِلَٰهِ  ٱلنَّاسِ  ،  مِن  شَرِّ  ٱلْوَسْوَاسِ   ٱلْخَنَّاسِ  ،  ٱلَّذِى  يُوَسْوِسُ   فِى  صُدُورِ  ٱلنَّاسِ  ، مِنَ  ٱلْجِنَّةِ  وَٱلنَّاسِ .\n ثلاث مرات (3)",
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)"),
  MorningMemories(
      "أَصْـبَحْنا  وَأَصْـبَحَ  المُـلْكُ  لله  وَالحَمدُ  لله  ،  لا  إلهَ  إلاّ  اللّهُ  وَحدَهُ  لا  شَريكَ  لهُ  ،  لهُ  المُـلكُ  ولهُ  الحَمْـد  ، وهُوَ  على  كلّ  شَيءٍ  قدير ،"
          " رَبِّ  أسْـأَلُـكَ  خَـيرَ  ما  في  هـذا  اليوم  وَخَـيرَ  ما  بَعْـدَه  ،  وَأَعـوذُ  بِكَ  مِنْ  شَـرِّ  ما  في  هـذا  اليوم  وَشَرِّ  ما  بَعْـدَه ، "
          "رَبِّ  أَعـوذُ  بِكَ  مِنَ  الْكَسَـلِ  وَسـوءِ  الْكِـبَر  ،  رَبِّ  أَعـوذُ  بِكَ  مِنْ  عَـذابٍ  في  النّـارِ  وَعَـذابٍ  في  القَـبْر .\n مرة واحدة (1)",
      ""),
  MorningMemories(
      "اللّهـمَّ  أَنْتَ  رَبِّـي  لا  إلهَ  إلاّ أ َنْتَ ،"
          " خَلَقْتَنـي  وَأَنا  عَبْـدُك  ،  وَأَنا  عَلـى  عَهْـدِكَ  وَوَعْـدِكَ  ما  اسْتَـطَعْـت  ،  أَعـوذُبِكَ  مِنْ  شَـرِّ  ما  صَنَـعْت ، "
          "أَبـوءُ  لَـكَ  بِنِعْـمَتِـكَ  عَلَـيَّ  وَأَبـوءُ  بِذَنْـبي  فَاغْفـِرْ  لي  فَإِنَّـهُ  لا  يَغْـفِرُ  الذُّنـوبَ  إِلاّ  أَنْتَ .\nمرة واحدة (1)",
      "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح"),
  MorningMemories(
      "رَضيـتُ  بِاللهِ  رَبَّـاً  وَبِالإسْلامِ  ديـناً  وَبِمُحَـمَّدٍ  صلى  الله  عليه  وسلم  نَبِيّـاً .\nثلاث مرات (3)",
      "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة"),
  MorningMemories(
      "اللّهُـمَّ  إِنِّـي  أَصْبَـحْتُ  أُشْـهِدُك ، وَأُشْـهِدُ  حَمَلَـةَ  عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك"
          " ، أَنَّـكَ  أَنْـتَ  اللهُ  لا  إلهَ  إلاّ  أَنْـتَ  وَحْـدَكَ  لا  شَريكَ  لَـك ، وَأَنَّ ُ  مُحَمّـداً  عَبْـدُكَ  وَرَسـولُـك .\nأربعة مرات (4)",
      "من قالها أعتقه الله من النار"),
  MorningMemories(
      "اللّهُـمَّ  ما  أَصْبَـَحَ  بي  مِـنْ  نِعْـمَةٍ "
          "أَو  بِأَحَـدٍ  مِـنْ  خَلْـقِك  ،  فَمِـنْكَ  وَحْـدَكَ  لا  شريكَ  لَـك  ،  فَلَـكَ  الْحَمْـدُ  وَلَـكَ  الشُّكْـر .\nمرة واحدة (1)",
      "من قالها حين يصبح أدى شكر يومه"),
  MorningMemories(
      "حَسْبِـيَ  اللّهُ  لا  إلهَ  إلاّ  هُوَ  عَلَـيهِ  تَوَكَّـلتُ  وَهُوَ  رَبُّ  العَرْشِ  العَظـيم .\nسبع مرات (7)",
      "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة"),
  MorningMemories(
      "بِسـمِ  اللهِ  الذي  لا  يَضُـرُّ  مَعَ  اسمِـهِ  شَيءٌ  في  الأرْضِ  وَلا  في  السّمـاءِ  وَهـوَ  السّمـيعُ  العَلـيم .\nثلاث مرات (3)",
      "من قالها لم يضره من الله شيء"),
  MorningMemories(
      "اللّهُـمَّ  بِكَ  أَصْـبَحْنا  وَبِكَ  أَمْسَـينا  ،  وَبِكَ  نَحْـيا  وَبِكَ  نَمُـوتُ  وَإِلَـيْكَ  النُّـشُور .\nمرة واحدة (1)",
      ""),
  MorningMemories(
      "أَصْبَـحْـنا  عَلَى  فِطْرَةِ  الإسْلاَمِ  ،  وَعَلَى  كَلِمَةِ  الإِخْلاَصِ  ،  وَعَلَى  دِينِ  نَبِيِّنَا  مُحَمَّدٍ  صَلَّى  اللهُ  عَلَيْهِ  وَسَلَّمَ،"
          ". وَعَلَى  مِلَّةِ  أَبِينَا  إبْرَاهِيمَ  حَنِيفاً  مُسْلِماً  وَمَا  كَانَ  مِنَ  المُشْرِكِينَ.\nمرة واحدة (1) ",
      ""),
  MorningMemories(
      "سُبْحـانَ  اللهِ  وَبِحَمْـدِهِ  عَدَدَ  خَلْـقِه  ،  وَرِضـا  نَفْسِـه  ،  وَزِنَـةَ  عَـرْشِـه  ،  وَمِـدادَ كَلِمـاتِـه .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "اللّهُـمَّ  عافِـني  في  بَدَنـي  ،  اللّهُـمَّ  عافِـني  في  سَمْـعي  ،  اللّهُـمَّ  عافِـني  في  بَصَـري  ،  لا  إلهَ  إلاّ  أَنْـتَ .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "اللّهُـمَّ  إِنّـي  أَعـوذُ  بِكَ  مِنَ  الْكُـفر  ،  وَالفَـقْر  ،  وَأَعـوذُ  بِكَ  مِنْ  عَذابِ  القَـبْر  ،  لا  إلهَ  إلاّ  أَنْـتَ .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "اللّهُـمَّ  إِنِّـي  أسْـأَلُـكَ  العَـفْوَ  وَالعـافِـيةَ  في  الدُّنْـيا  وَالآخِـرَة ،"
          " اللّهُـمَّ  إِنِّـي  أسْـأَلُـكَ  العَـفْوَ  وَالعـافِـيةَ  في  ديني  وَدُنْـيايَ  وَأهْـلي  وَمالـي  ،  اللّهُـمَّ  اسْتُـرْ  عـوْراتي  وَآمِـنْ  رَوْعاتـي ، "
          "اللّهُـمَّ  احْفَظْـني  مِن  بَـينِ  يَدَيَّ  وَمِن  خَلْفـي  وَعَن  يَمـيني  وَعَن  شِمـالي  ،  وَمِن  فَوْقـي  ،  وَأَعـوذُ  بِعَظَمَـتِكَ  أَن  أُغْـتالَ  مِن  تَحْتـي .\nمرة واحدة (1)",
      ""),
  MorningMemories(
      "يَا  حَيُّ  يَا  قيُّومُ  بِرَحْمَتِكَ  أسْتَغِيثُ  أصْلِحْ  لِي  شَأنِي  كُلَّهُ  وَلاَ  تَكِلْنِي  إلَى  نَفْسِي  طَـرْفَةَ  عَيْنٍ .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "أَصْبَـحْـنا  وَأَصْبَـحْ  المُـلكُ  للهِ  رَبِّ  العـالَمـين ،"
          " اللّهُـمَّ  إِنِّـي  أسْـأَلُـكَ  خَـيْرَ  هـذا  الـيَوْم  ،  فَـتْحَهُ  ،  وَنَصْـرَهُ  ،  وَنـورَهُ  وَبَـرَكَتَـه ُ ،  وَهُـداهُ "
          "، وَأَعـوذُ  بِـكَ  مِـنْ  شَـرِّ  ما  فـيهِ  وَشَـرِّ  ما  بَعْـدَه .\nمرة واحدة (1)",
      ""),
  MorningMemories(
      "اللّهُـمَّ  عالِـمَ  الغَـيْبِ  وَالشّـهادَةِ  فاطِـرَ  السّماواتِ  وَالأرْضِ  رَبَّ  كـلِّ  شَـيءٍ  وَمَليـكَه ، "
          "أَشْهَـد ُ أَنْ  لا  إِلـهَ  إِلاّ  أَنْت  ، أَعـوذُ  بِكَ  مِن  شَـرِّ  نَفْسـي  وَمِن  شَـرِّ  الشَّيْـطانِ  وَشِرْكِهِ  "
          "، وَأَنْ  أَقْتَـرِفَ  عَلـى  نَفْسـي  سوءاً  أَوْ  أَجُـرَّهُ  إِلـى  مُسْـلِم .\nمرة واحدة (1)",
      ""),
  MorningMemories(
      "أَعـوذُ  بِكَلِمـاتِ  اللّهِ  التّـامّـاتِ  مِنْ  شَـرِّ  ما  خَلَـق .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "اللَّهُمَّ  صَلِّ  وَسَلِّمْ  وَبَارِكْ  على  نَبِيِّنَا مُحمَّد .\nعشرة مرات (10)",
      "قال النبي من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة"),
  MorningMemories(
      "اللَّهُمَّ  إِنَّا  نَعُوذُ  بِكَ  مِنْ  أَنْ  نُشْرِكَ  بِكَ  شَيْئًا  نَعْلَمُهُ  ، وَنَسْتَغْفِرُكَ  لِمَا  لَا  نَعْلَمُهُ .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "اللَّهُمَّ  إِنِّي  أَعُوذُ  بِكَ  مِنْ  الْهَمِّ  وَالْحَزَنِ  ، وَأَعُوذُ  بِكَ  مِنْ  الْعَجْزِ  وَالْكَسَلِ ،"
          " وَأَعُوذُ  بِكَ  مِنْ  الْجُبْنِ  وَالْبُخْلِ  ، وَأَعُوذُ  بِكَ  مِنْ  غَلَبَةِ  الدَّيْنِ  ، وَقَهْرِ  الرِّجَالِ .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "أسْتَغْفِرُ  اللهَ  العَظِيمَ  الَّذِي  لاَ  إلَهَ  إلاَّ  هُوَ  ، الحَيُّ  القَيُّومُ  ، وَأتُوبُ  إلَيهِ .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      " يَا  رَبِّ  , لَكَ  الْحَمْدُ  كَمَا  يَنْبَغِي  لِجَلَالِ  وَجْهِكَ  , وَلِعَظِيمِ  سُلْطَانِكَ .\nثلاث مرات (3)",
      ""),
  MorningMemories(
      "اللَّهُمَّ  إِنِّي  أَسْأَلُكَ عِلْمًا  نَافِعًا  ، وَرِزْقًا  طَيِّبًا  ، وَعَمَلًا  مُتَقَبَّلًا. \nمرة واحدة (1)",
      ""),
  MorningMemories(
      "اللَّهُمَّ  أَنْتَ  رَبِّي  لا  إِلَهَ  إِلا  أَنْتَ  ، عَلَيْكَ  تَوَكَّلْتُ "
          "، وَأَنْتَ  رَبُّ  الْعَرْشِ  الْعَظِيمِ  ,  مَا  شَاءَ  اللَّهُ  كَانَ  ، وَمَا  لَمْ  يَشَأْ  لَمْ  يَكُنْ "
          "، وَلا  حَوْلَ  وَلا  قُوَّةَ  إِلا  بِاللَّهِ  الْعَلِيِّ  الْعَظِيمِ  , أَعْلَمُ  أَنَّ  اللَّهَ  عَلَى  كُلِّ  شَيْءٍ  قَدِيرٌ "
          "، وَأَنَّ  اللَّهَ  قَدْ  أَحَاطَ  بِكُلِّ  شَيْءٍ  عِلْمًا  , اللَّهُمَّ  إِنِّي  أَعُوذُ  بِكَ  مِنْ  شَرِّ  نَفْسِي ، "
          "وَمِنْ  شَرِّ  كُلِّ  دَابَّةٍ  أَنْتَ  آخِذٌ  بِنَاصِيَتِهَا  ، إِنَّ رَبِّي  عَلَى  صِرَاطٍ  مُسْتَقِيم ٍ.\nمرة واحدة (1)",
      ""),
  MorningMemories(
      " لَا  إلَه  إلّا  اللهُ  وَحْدَهُ  لَا  شَرِيكَ  لَهُ  ، لَهُ  الْمُلْكُ  وَلَهُ  الْحَمْدُ  وَهُوَ  عَلَى  كُلِّ  شَيْءِ  قَدِيرِ .\nمئة مرة (100)",
      "من قالها كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان"),
  MorningMemories(" سُبْحـانَ  اللهِ  وَبِحَمْـدِهِ .\nمئة مرة (100)",
      " من قالها حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ"),
  MorningMemories("أسْتَغْفِرُ  اللهَ  وَأتُوبُ  إلَيْهِ .\nمئة مرة (100)",
      "من قالها له مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى"),
];

class MorningMemories {
  String? azkar;
  String? description2;

  MorningMemories(this.azkar, this.description2);
}

List<EveningMemories> Evening = [
  EveningMemories(
      "أَعُوذُ  بِاللهِ  مِنْ  الشَّيْطَانِ  الرَّجِيمِ  \n اللّهُ  لاَ  إِلَـهَ  إِلاَّ  هُوَ  الْحَيُّ  الْقَيُّومُ  لاَ  تَأْخُذُهُ  سِنَةٌ"
          " وَلاَ  نَوْمٌ  لَّهُ  مَا  فِي  السَّمَاوَاتِ  وَمَا  فِي "
          " الأَرْضِ    مَن  ذَا  الَّذِي  يَشْفَعُ  عِنْدَهُ  إِلاَّ  بِإِذْنِهِ  يَعْلَمُ  مَا  بَيْنَ  أَيْدِيهِمْ "
          " وَمَا  خَلْفَهُمْ  وَلاَ  يُحِيطُونَ  بِشَيْءٍ  مِّنْ  عِلْمِهِ  إِلاَّ  بِمَا  شَاء  وَسِعَ  كُرْسِيُّهُ "
          "السَّمَاوَاتِ  وَالأَرْضَ   وَلاَ  يَؤُودُهُ  حِفْظُهُمَا  وَهُوَ  الْعَلِيُّ  الْعَظِيمُ . \n مرة واحدة (1)",
      "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح "),
  EveningMemories(
      "آمَنَ  الرَّسُولُ  بِمَا  أُنْزِلَ  إِلَيْهِ  مِنْ  رَبِّهِ  وَالْمُؤْمِنُونَ ۚ  كُلٌّ  آمَنَ  بِاللَّهِ  وَمَلَائِكَتِهِ  وَكُتُبِهِ  وَرُسُلِهِ  لَا  نُفَرِّقُ  بَيْنَ  أَحَدٍ   مِنْ  رُسُلِهِ ۚ  وَقَالُوا  سَمِعْنَا  وَأَطَعْنَا ۖ  غُفْرَانَكَ  رَبَّنَا  وَإِلَيْكَ  الْمَصِيرُ  .  لَا  يُكَلِّفُ  اللَّهُ  نَفْسًا  إِلَّا  وُسْعَهَا  لَهَا  مَا  كَسَبَتْ  وَعَلَيْهَا  مَا  اكْتَسَبَتْ  رَبَّنَا  لَا  تُؤَاخِذْنَا  إِنْ  نَّسِينَآ أَ وْ  أَخْطَأْنَا  رَبَّنَا  وَلَا  تَحْمِلْ  عَلَيْنَا  إِصْرًا  كَمَا  حَمَلْتَهُ  عَلَى  الَّذِينَ  مِنْ  قَبْلِنَا  رَبَّنَا  وَلَا  تُحَمِّلْنَا  مَا  لَا  طَاقَةَ  لَنَا  بِهِ  وَاعْفُ  عَنَّا  وَاغْفِرْ  لَنَا  وَارْحَمْنَا  أَنْتَ  مَوْلَانَا  فَانْصُرْنَا  عَلَى  الْقَوْمِ  الْكَافِرِينَ . [البقرة 285 – 286]\n مرة واحدة (1) ",
      "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه"),
  EveningMemories(
      "بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم\n "
          "قُلْ  هُوَ  ٱللَّهُ أَحَدٌ  ،  ٱللَّهُ  ٱلصَّمَدُ  ،  لَمْ  يَلِدْ  وَلَمْ  يُولَدْ  ،  وَلَمْ  يَكُن  لَّهُۥ  كُفُوًا  أَحَدٌۢ . \n ثلاث مرات (3)",
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)"),
  EveningMemories(
      "بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم\n "
          "قُلْ  أَعُوذُ  بِرَبِّ  ٱلْفَلَقِ  ،  مِن  شَرِّ  مَا  خَلَقَ  ،  وَمِن  شَرِّ  غَاسِقٍ  إِذَا  وَقَبَ ،  وَمِن  شَرِّ  ٱلنَّفَّٰثَٰتِ  فِى  ٱلْعُقَدِ  ،  وَمِن  شَرِّ  حَاسِدٍ  إِذَا  حَسَدَ . \n ثلاث مرات (3)",
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)"),
  EveningMemories(
      "بِسْمِ  اللهِ  الرَّحْمنِ  الرَّحِيم\n "
          "قُلْ  أَعُوذُ  بِرَبِّ  ٱلنَّاسِ  ،  مَلِكِ  ٱلنَّاسِ  ،  إِلَٰهِ  ٱلنَّاسِ  ،  مِن  شَرِّ  ٱلْوَسْوَاسِ   ٱلْخَنَّاسِ  ،  ٱلَّذِى  يُوَسْوِسُ   فِى  صُدُورِ  ٱلنَّاسِ  ، مِنَ  ٱلْجِنَّةِ  وَٱلنَّاسِ .\n ثلاث مرات (3)",
      "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين)"),
  EveningMemories(
      "أَمْسَيْـنا  وَأَمْسـى  المـلكُ  لله  وَالحَمدُ  لله  ، لا  إلهَ  إلاّ  اللّهُ  وَحدَهُ  لا  شَريكَ  لهُ  ، لهُ  المُـلكُ  ولهُ  الحَمْـد  ، وهُوَ  على  كلّ  شَيءٍ  قدير  ، رَبِّ  أسْـأَلُـكَ  خَـيرَ  ما  في  هـذهِ  اللَّـيْلَةِ  وَخَـيرَ  ما  بَعْـدَهـا  ، وَأَعـوذُ  بِكَ  مِنْ  شَـرِّ  ما  في  هـذهِ  اللَّـيْلةِ  وَشَرِّ  ما  بَعْـدَهـا  ، رَبِّ  أَعـوذُ  بِكَ  مِنَ  الْكَسَـلِ  وَسـوءِ  الْكِـبَر  ، رَبِّ  أَعـوذُ  بِكَ  مِنْ  عَـذابٍ  في  النّـارِ  وَعَـذابٍ  في  القَـبْر .\nمرة واحدة (1)",
      ""),
  EveningMemories(
      "اللّهـمَّ  أَنْتَ  رَبِّـي  لا  إلهَ  إلاّ  أَنْتَ  ، خَلَقْتَنـي  وَأَنا  عَبْـدُك  ، وَأَنا  عَلـى  عَهْـدِكَ  وَوَعْـدِكَ  ما  اسْتَـطَعْـت  ، أَعـوذُ  بِكَ  مِنْ  شَـرِّ  ما  صَنَـعْت  ، أَبـوءُ  لَـكَ  بِنِعْـمَتِـكَ  عَلَـيَّ  وَأَبـوءُ  بِذَنْـبي  فَاغْفـِرْ  لي  فَإِنَّـهُ  لا  يَغْـفِرُ  الذُّنـوبَ  إِلاّ  أَنْتَ .\nمرة واحدة (1)",
      "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح"),
  EveningMemories(
      "رَضيـت ُ بِاللهِ  رَبَّـاً  وَبِالإسْلامِ  ديـناً  وَبِمُحَـمَّدٍ  صلى  الله  عليه  وسلم  نَبِيّـاً .\nمرة واحدة (1)",
      "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة"),
  EveningMemories(
      "اللّهُـمَّ  إِنِّـي  أَمسيتُ  أُشْـهِدُك  ، وَأُشْـهِدُ  حَمَلَـةَ  عَـرْشِـك  ، وَمَلَائِكَتَكَ  ، وَجَمـيعَ  خَلْـقِك  ، أَنَّـكَ  أَنْـتَ  اللهُ  لا  إلهَ  إلاّ  أَنْـتَ  وَحْـدَكَ  لا  شَريكَ  لَـك  ، وَأَنَّ  ُ مُحَمّـداً  عَبْـدُكَ  وَرَسـولُـك .\nأربع مرات (4)",
      "من قالها أعتقه الله من النار"),
  EveningMemories(
      "اللّهُـمَّ  ما  أَمسى  بي  مِـنْ  نِعْـمَةٍ  أَو  بِأَحَـدٍ  مِـنْ  خَلْـقِك  ، فَمِـنْكَ  وَحْـدَكَ  لا  شريكَ  لَـك  ، فَلَـكَ  الْحَمْـد ُ وَلَـكَ  الشُّكْـر .\nمرة واحدة(1)",
      "من قالها حين يمسى أدى شكر يومه"),
  EveningMemories(
      "حَسْبِـيَ  اللّهُ  لا  إلهَ  إلاّ  هُوَ  عَلَـيهِ  تَوَكَّـلتُ  وَهُوَ  رَبُّ  العَرْشِ  العَظـيم .\nسبع مرات(7)",
      "من قالها كفاه الله ما أهمه من أمر الدنيا والآخرة"),
  EveningMemories(
      "بِسـمِ  اللهِ  الذي  لا  يَضُـرُّ  مَعَ  اسمِـهِ  شَيءٌ  في  الأرْضِ  وَلا  في  السّمـاءِ  وَهـوَ  السّمـيعُ  العَلـيم .\nثلاث مرات (3)",
      "من قالها لم يضره من الله شيء"),
  EveningMemories(
      "اللّهُـمَّ  بِكَ  أَمْسَـينا  وَبِكَ  أَصْـبَحْنا  ، وَبِكَ  نَحْـيا  وَبِكَ  نَمُـوتُ  وَإِلَـيْكَ  الْمَصِيرُ .\nمرة واحدة(1)",
      ""),
  EveningMemories(
      "أَمْسَيْنَا  عَلَى  فِطْرَةِ الإسْلاَمِ  ، وَعَلَى  كَلِمَةِ  الإِخْلاَصِ  ، وَعَلَى  دِينِ  نَبِيِّنَا  مُحَمَّدٍ  صَلَّى  اللهُ  عَلَيْهِ  وَسَلَّمَ  ، وَعَلَى  مِلَّةِ  أَبِينَا  إبْرَاهِيمَ  حَنِيفاً  مُسْلِماً  وَمَا  كَانَ  مِنَ  المُشْرِكِينَ .\nمرة واحدة(1)",
      ""),
  EveningMemories(
      "سُبْحـانَ  اللهِ  وَبِحَمْـدِهِ  عَدَدَ  خَلْـقِه  ،  وَرِضـا  نَفْسِـه  ،  وَزِنَـةَ  عَـرْشِـه  ،  وَمِـدادَ كَلِمـاتِـه .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "اللّهُـمَّ  عافِـني  في  بَدَنـي  ،  اللّهُـمَّ  عافِـني  في  سَمْـعي  ،  اللّهُـمَّ  عافِـني  في  بَصَـري  ،  لا  إلهَ  إلاّ  أَنْـتَ .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "اللّهُـمَّ  إِنّـي  أَعـوذُ  بِكَ  مِنَ  الْكُـفر  ،  وَالفَـقْر  ،  وَأَعـوذُ  بِكَ  مِنْ  عَذابِ  القَـبْر  ،  لا  إلهَ  إلاّ  أَنْـتَ .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "اللّهُـمَّ  إِنِّـي  أسْـأَلُـكَ  العَـفْوَ  وَالعـافِـيةَ  في  الدُّنْـيا  وَالآخِـرَة ،"
          " اللّهُـمَّ  إِنِّـي  أسْـأَلُـكَ  العَـفْوَ  وَالعـافِـيةَ  في  ديني  وَدُنْـيايَ  وَأهْـلي  وَمالـي  ،  اللّهُـمَّ  اسْتُـرْ  عـوْراتي  وَآمِـنْ  رَوْعاتـي ، "
          "اللّهُـمَّ  احْفَظْـني  مِن  بَـينِ  يَدَيَّ  وَمِن  خَلْفـي  وَعَن  يَمـيني  وَعَن  شِمـالي  ،  وَمِن  فَوْقـي  ،  وَأَعـوذُ  بِعَظَمَـتِكَ  أَن  أُغْـتالَ  مِن  تَحْتـي .\nمرة واحدة (1)",
      ""),
  EveningMemories(
      "يَا  حَيُّ  يَا  قيُّومُ  بِرَحْمَتِكَ  أسْتَغِيثُ  أصْلِحْ  لِي  شَأنِي  كُلَّهُ  وَلاَ  تَكِلْنِي  إلَى  نَفْسِي  طَـرْفَةَ  عَيْنٍ .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "أَمْسَيْنا  وَأَمْسَى  المُـلكُ  للهِ  رَبِّ  العـالَمـين ،"
          " اللّهُـمَّ  إِنِّـي  أسْـأَلُـكَ  خَـيْرَ  هَذَه اللَّيْلَةِ  ،  فَـتْحَهُ  ،  وَنَصْـرَهُ  ،  وَنـورَهُ  وَبَـرَكَتَـه ُ ،  وَهُـداهُ "
          "، وَأَعـوذُ  بِـكَ  مِـنْ  شَـرِّ  ما  فـيهِ  وَشَـرِّ  ما  بَعْـدَه .\nمرة واحدة (1)",
      ""),
  EveningMemories(
      "اللّهُـمَّ  عالِـمَ  الغَـيْبِ  وَالشّـهادَةِ  فاطِـرَ  السّماواتِ  وَالأرْضِ  رَبَّ  كـلِّ  شَـيءٍ  وَمَليـكَه ، "
          "أَشْهَـد ُ أَنْ  لا  إِلـهَ  إِلاّ  أَنْت  ، أَعـوذُ  بِكَ  مِن  شَـرِّ  نَفْسـي  وَمِن  شَـرِّ  الشَّيْـطانِ  وَشِرْكِهِ  "
          "، وَأَنْ  أَقْتَـرِفَ  عَلـى  نَفْسـي  سوءاً  أَوْ  أَجُـرَّهُ  إِلـى  مُسْـلِم .\nمرة واحدة (1)",
      ""),
  EveningMemories(
      "أَعـوذُ  بِكَلِمـاتِ  اللّهِ  التّـامّـاتِ  مِنْ  شَـرِّ  ما  خَلَـق .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "اللَّهُمَّ  صَلِّ  وَسَلِّمْ  وَبَارِكْ  على  نَبِيِّنَا مُحمَّد .\nعشرة مرات (10)",
      "قال النبي من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة"),
  EveningMemories(
      "اللَّهُمَّ  إِنَّا  نَعُوذُ  بِكَ  مِنْ  أَنْ  نُشْرِكَ  بِكَ  شَيْئًا  نَعْلَمُهُ  ، وَنَسْتَغْفِرُكَ  لِمَا  لَا  نَعْلَمُهُ .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "اللَّهُمَّ  إِنِّي  أَعُوذُ  بِكَ  مِنْ  الْهَمِّ  وَالْحَزَنِ  ، وَأَعُوذُ  بِكَ  مِنْ  الْعَجْزِ  وَالْكَسَلِ ،"
          " وَأَعُوذُ  بِكَ  مِنْ  الْجُبْنِ  وَالْبُخْلِ  ، وَأَعُوذُ  بِكَ  مِنْ  غَلَبَةِ  الدَّيْنِ  ، وَقَهْرِ  الرِّجَالِ .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "أسْتَغْفِرُ  اللهَ  العَظِيمَ  الَّذِي  لاَ  إلَهَ  إلاَّ  هُوَ  ، الحَيُّ  القَيُّومُ  ، وَأتُوبُ  إلَيهِ .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      " يَا  رَبِّ  , لَكَ  الْحَمْدُ  كَمَا  يَنْبَغِي  لِجَلَالِ  وَجْهِكَ  , وَلِعَظِيمِ  سُلْطَانِكَ .\nثلاث مرات (3)",
      ""),
  EveningMemories(
      "لَا  إلَه  إلّا  اللهُ  وَحْدَهُ  لَا  شَرِيكَ  لَهُ  ، لَهُ  الْمُلْكُ  وَلَهُ  الْحَمْدُ  وَهُوَ  عَلَى  كُلِّ  شَيْءِ  قَدِيرِ .\n مئة مرة (100)",
      "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان"),
  EveningMemories(
      "اللَّهُمَّ  أَنْتَ  رَبِّي  لا  إِلَهَ  إِلا  أَنْتَ  ، عَلَيْكَ  تَوَكَّلْتُ "
          "، وَأَنْتَ  رَبُّ  الْعَرْشِ  الْعَظِيمِ  ,  مَا  شَاءَ  اللَّهُ  كَانَ  ، وَمَا  لَمْ  يَشَأْ  لَمْ  يَكُنْ "
          "، وَلا  حَوْلَ  وَلا  قُوَّةَ  إِلا  بِاللَّهِ  الْعَلِيِّ  الْعَظِيمِ  , أَعْلَمُ  أَنَّ  اللَّهَ  عَلَى  كُلِّ  شَيْءٍ  قَدِيرٌ "
          "، وَأَنَّ  اللَّهَ  قَدْ  أَحَاطَ  بِكُلِّ  شَيْءٍ  عِلْمًا  , اللَّهُمَّ  إِنِّي  أَعُوذُ  بِكَ  مِنْ  شَرِّ  نَفْسِي ، "
          "وَمِنْ  شَرِّ  كُلِّ  دَابَّةٍ  أَنْتَ  آخِذٌ  بِنَاصِيَتِهَا  ، إِنَّ رَبِّي  عَلَى  صِرَاطٍ  مُسْتَقِيم ٍ.\nمرة واحدة (1)",
      ""),
  EveningMemories(" سُبْحـانَ  اللهِ  وَبِحَمْـدِهِ .\nمئة مرة (100)",
      " من قالها حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ"),
];

class EveningMemories {
  String? azkar;
  String? description2;

  EveningMemories(this.azkar, this.description2);
}

List<PrayersfromtheQuran> Quran2 = [
  PrayersfromtheQuran(
      "( رَّبِّ  اغْفِرْ  وَارْحَمْ  وَأَنتَ  خَيْرُ  الرَّاحِمِينَ )."),
  PrayersfromtheQuran(
      "( لَا  إِلَهَ إ ِلا  أَنْتَ  سُبْحَانَكَ  إِنِّي  كُنْتُ  مِنَ  الظَّالِمِين َ)."),
  PrayersfromtheQuran(
      "( رَبَّنَا  آتِنَا  فِي  الدُّنْيَا  حَسَنَةً  وَفِي  الآخِرَةِ  حَسَنَةً  وَقِنَا  عَذَابَ  النَّارِ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  ظَلَمْنَا  أَنْفُسَنَا  وَإِنْ  لَمْ  تَغْفِرْ  لَنَا  وَتَرْحَمْنَا  لَنَكُونَنَّ  مِنَ  الْخَاسِرِينَ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  أَفْرِغْ  عَلَيْنَا  صَبْرًا  وَثَبِّتْ  أَقْدَامَنَا  وَانصُرْنَا  عَلَى  الْقَوْمِ  الْكَافِرِينَ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  عَلَيْكَ  تَوَكَّلْنَا  وَإِلَيْكَ  أَنَبْنَا  وَإِلَيْكَ  الْمَصِيرُ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  لاَ  تُؤَاخِذْنَا  إِن  نَّسِينَا  أَوْ  أَخْطَأْنَا  رَبَّنَا  وَلاَ  تَحْمِلْ  عَلَيْنَا  إِصْرًا  كَمَا  حَمَلْتَهُ  عَلَى  الَّذِينَ  مِن  قَبْلِنَا  رَبَّنَا  وَلاَ  تُحَمِّلْنَا  مَا  لاَ  طَاقَةَ  لَنَا  بِهِ  وَاعْفُ  عَنَّا  وَاغْفِرْ  لَنَا  وَارْحَمْنَا أَنتَ  مَوْلاَنَا  فَانصُرْنَا  عَلَى  الْقَوْمِ  الْكَافِرِينَ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  لَا  تَجْعَلْنَا  فِتْنَةً  لِلَّذِينَ  كَفَرُوا  وَاغْفِرْ  لَنَا  رَبَّنَا  إِنَّكَ  أَنْتَ  الْعَزِيزُ  الْحَكِيمُ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  إِنَّنَا  آمَنَّا  فَاغْفِرْ  لَنَا  ذُنُوبَنَا  وَقِنَا  عَذَابَ  النَّارِ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  آمَنَّا  بِمَا  أَنزَلَتْ  وَاتَّبَعْنَا  الرَّسُولَ  فَاكْتُبْنَا  مَعَ  الشَّاهِدِين َ)."),
  PrayersfromtheQuran(
      "( رَبَّنَا  آمَنَّا  فَاغْفِرْ  لَنَا  وَارْحَمْنَا  وَأَنْتَ  خَيْرُ  الرَّاحِمِينَ )."),
  PrayersfromtheQuran(
      "( رَبِّ  هَبْ  لِي مِن  لَّدُنْكَ  ذُرِّيَّةً  طَيِّبَةً  إِنَّكَ  سَمِيعُ  الدُّعَاء )."),
  PrayersfromtheQuran(
      "( ربَّنَا  اغْفِرْ  لَنَا  ذُنُوبَنَا  وَإِسْرَافَنَا  فِي  أَمْرِنَا  وَثَبِّتْ  أَقْدَامَنَا  وانصُرْنَا  عَلَى  الْقَوْمِ  الْكَافِرِين َ)."),
  PrayersfromtheQuran(
      "( رَبَّنَا  مَا  خَلَقْتَ  هَذا  بَاطِلاً  سُبْحَانَكَ  فَقِنَا  عَذَابَ  النَّارِ  ، رَبَّنَا  إِنَّكَ  مَن  تُدْخِلِ  النَّارَ  فَقَدْ  أَخْزَيْتَهُ  وَمَا  لِلظَّالِمِينَ  مِنْ  أَنصَار  ٍ، رَّبَّنَا  إِنَّنَا  سَمِعْنَا  مُنَادِيًا  يُنَادِي  لِلإِيمَانِ  أَنْ  آمِنُواْ  بِرَبِّكُمْ  فَآمَنَّا  رَبَّنَا  فَاغْفِرْ  لَنَا  ذُنُوبَنَا  وَكَفِّرْ  عَنَّا  سَيِّئَاتِنَا  وَتَوَفَّنَا  مَعَ  الأبْرَارِ  ، رَبَّنَا  وَآتِنَا  مَا  وَعَدتَّنَا  عَلَى  رُسُلِكَ  وَلاَ  تُخْزِنَا  يَوْمَ  الْقِيَامَةِ  إِنَّكَ  لاَ  تُخْلِفُ  الْمِيعَادَ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  إِنَّنَا  آمَنَّا  فَاغْفِرْ  لَنَا  ذُنُوبَنَا  وَقِنَا  عَذَابَ  النَّارِ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  تَقَبَّلْ  مِنَّا  إِنَّكَ  أَنْتَ  السَّمِيعُ  الْعَلِيمُ  ، رَبَّنَا  وَاجْعَلْنَا  مُسْلِمَيْنِ  لَكَ  وَمِنْ  ذُرِّيَّتِنَا  أُمَّةً  مُسْلِمَةً  لَكَ  وَأَرِنَا  مَنَاسِكَنَا  وَتُبْ  عَلَيْنَا  إِنَّكَ  أَنْتَ  التَّوَّابُ  الرَّحِيم ُ)."),
  PrayersfromtheQuran(
      "( رَبَّنَا  ظَلَمْنَا  أَنفُسَنَا  وَإِن  لَّمْ  تَغْفِرْ  لَنَا  وَتَرْحَمْنَا  لَنَكُونَنَّ  مِنَ  الْخَاسِرِينَ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  أَتْمِمْ  لَنَا  نُورَنَا  وَاغْفِرْ  لَنَا  إِنَّكَ  عَلَى  كُلِّ  شَيْءٍ قَدِيرٌ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  لَا  تَجْعَلْنَا  فِتْنَةً  لِلْقَوْمِ  الظَّالِمِينَ  ، وَنَجِّنَا  بِرَحْمَتِكَ  مِنَ  الْقَوْمِ  الْكَافِرِين َ)."),
  PrayersfromtheQuran(
      "( أَنْتَ  وَلِيُّنَا  فَاغْفِرْ  لَنَا  وَارْحَمْنَا  وَأَنْتَ  خَيْرُ  الْغَافِرِين  َ، وَاكْتُبْ  لَنَا  فِي  هَذِهِ  الدُّنْيَا  حَسَنَةً  وَفِي  الْآخِرَة ِ)."),
  PrayersfromtheQuran(
      "( رَبَّنَا  آتِنَا  مِنْ  لَدُنْكَ  رَحْمَةً  وَهَيِّئْ  لَنَا  مِنْ  أَمْرِنَا  رَشَدًا )."),
  PrayersfromtheQuran(
      "( سَمِعْنَا  وَأَطَعْنَا  غُفْرَانَكَ  رَبَّنَا  وَإِلَيْكَ  الْمَصِيرُ )."),
  PrayersfromtheQuran(
      "( حَسْبِيَ  اللّهُ  لا  إِلَـه َ إِلاَّ  هُوَ  عَلَيْهِ  تَوَكَّلْتُ  وَهُوَ  رَبُّ  الْعَرْشِ ا لْعَظِيمِ )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  لَا  تُزِغْ  قُلُوبَنَا  بَعْدَ  إِذْ  هَدَيْتَنَا  وَهَبْ  لَنَا  مِنْ  لَدُنْكَ  رَحْمَةً  إِنَّكَ  أَنْتَ  الْوَهَّابُ  ، رَبَّنَا  إِنَّكَ  جَامِعُ  النَّاسِ  لِيَوْمٍ  لَا  رَيْبَ  فِيهِ  إِنَّ  اللَّهَ  لَا  يُخْلِفُ  الْمِيعَادَ )."),
  PrayersfromtheQuran(
      "( رَبِّ  أَوْزِعْنِي  أَنْ  أَشْكُرَ  نِعْمَتَكَ  الَّتِي  أَنْعَمْتَ  عَلَيَّ  وَعَلَى  وَالِدَيَّ  وَأَنْ  أَعْمَلَ  صَالِحًا  تَرْضَاهُ  وَأَدْخِلْنِي  بِرَحْمَتِكَ  فِي  عِبَادِكَ  الصَّالِحِينَ )."),
  PrayersfromtheQuran(
      "( رَّبِّ  أَدْخِلْنِي  مُدْخَلَ  صِدْقٍ  وَأَخْرِجْنِي  مُخْرَجَ  صِدْقٍ  وَاجْعَل  لِّي  مِن  لَّدُنكَ  سُلْطَانًا  نَّصِيرًا )."),
  PrayersfromtheQuran(
      "( رَبِّ  اشْرَحْ  لِي  صَدْرِي  ، وَيَسِّرْ  لِي  أَمْرِي  ، وَاحْلُلْ  عُقْدَةً  مِنْ  لِسَانِي  ، يَفْقَهُوا  قَوْلِي )."),
  PrayersfromtheQuran("( رَبِّ  إِنِّي  ظَلَمْتُ  نَفْسِي  فَاغْفِرْ  لِي )."),
  PrayersfromtheQuran(
      "( عَسَى  رَبِّي  أَن  يَهْدِيَنِي  سَوَاءَ  السَّبِيل ِ)."),
  PrayersfromtheQuran(
      "( رَبِّ  إِنِّي  أَعُوذُ  بِكَ  أَنْ  أَسْأَلَكَ  مَا  لَيْسَ  لِي  بِهِ  عِلْمٌ  وَإِلَّا  تَغْفِرْ  لِي  وَتَرْحَمْنِي  أَكُنْ  مِنَ  الْخَاسِرِين َ)."),
  PrayersfromtheQuran(
      "( رَبِّ  اغْفِرْ  لِي  وَلِوَالِدَيَّ  وَلِمَنْ  دَخَلَ  بَيْتِيَ  مُؤْمِنًا  وَلِلْمُؤْمِنِينَ  وَالْمُؤْمِنَاتِ  وَلَا  تَزِدِ  الظَّالِمِينَ  إِلا  تَبَارًا )."),
  PrayersfromtheQuran(
      "( رَبِّ  أَعُوذُ  بِكَ  مِنْ  هَمَزَاتِ  الشَّيَاطِينِ  ، وَأَعُوذُ  بِكَ  رَبِّ  أَنْ  يَحْضُرُونِ )."),
  PrayersfromtheQuran("( رَبِّ  زِدْنِي  عِلْمًا )."),
  PrayersfromtheQuran(
      "( رَبَّنَا  هَبْ  لَنَا  مِنْ  أَزْوَاجِنَا  وَذُرِّيَّاتِنَا  قُرَّةَ  أَعْيُنٍ  وَاجْعَلْنَا  لِلْمُتَّقِينَ  إِمَاماً )."),
  PrayersfromtheQuran(
      "( رَبِّ  هَبْ  لِي  حُكْمًا  وَأَلْحِقْنِي  بِالصَّالِحِين  َ، وَاجْعَلْ  لِي  لِسَانَ  صِدْقٍ  فِي  الْآخِرِينَ  ،َ اجْعَلْنِي  مِنْ  وَرَثَةِ  جَنَّةِ  النَّعِيمِ )."),
  PrayersfromtheQuran(
      "( رَبِّ  لَا  تَذَرْنِي  فَرْدًا  وَأَنتَ  خَيْرُ  الْوَارِثِينَ )."),
  PrayersfromtheQuran(
      "(رَبِّ  اجْعَلْنِي  مُقِيمَ  الصَّلاَةِ  وَمِن  ذُرِّيَّتِي  رَبَّنَا  وَتَقَبَّلْ  دُعَاءِ )."),
  PrayersfromtheQuran(
      "( رَبِّ  انْصُرْنِي  عَلَى  الْقَوْمِ  الْمُفْسِدِينَ )."),
  PrayersfromtheQuran(
      "( رَبِّ  بِمَا  أَنْعَمْتَ  عَلَيَّ  فَلَنْ  أَكُونَ  ظَهِيرًا  لِلْمُجْرِمِينَ )."),
  PrayersfromtheQuran(
      "( رَبِّ  لَا  تَذَرْنِي  فَرْدًا  وَأَنْتَ  خَيْرُ  الْوَارِثِينَ )."),
  PrayersfromtheQuran(
      "( وَلا  تُخْزِنِي  يَوْمَ  يُبْعَثُونَ  ، يَوْمَ  لَا  يَنْفَعُ  مَالٌ  وَلَا  بَنُونَ  ، إِلَّا  مَنْ  أَتَى  اللَّهَ  بِقَلْبٍ  سَلِيم ٍ)."),
  PrayersfromtheQuran(
      "( رَبِّ  اغْفِرْ  لِي  وَلِوَالِدَيَّ  وَلِمَن  دَخَلَ  بَيْتِيَ  مُؤْمِنًا  وَلِلْمُؤْمِنِينَ  وَالْمُؤْمِنَاتِ )."),
  PrayersfromtheQuran(
      "( رَبِّ  اجْعَلْنِي  مُقِيمَ  الصَّلَاةِ  وَمِنْ  ذُرِّيَّتِي  رَبَّنَا  وَتَقَبَّلْ  دُعَاءِ )."),
  PrayersfromtheQuran(
      "( رَبِّ  أَوْزِعْنِي أَنْ  أَشْكُرَ  نِعْمَتَكَ  الَّتِي أَنْعَمْتَ  عَلَيَّ  وَعَلَى  وَالِدَيَّ  وَأَنْ  أَعْمَلَ  صَالِحًا  تَرْضَاهُ  وَأَصْلِحْ  لِي  فِي  ذُرِّيَّتِي  إِنِّي  تُبْتُ  إِلَيْكَ  وَإِنِّي  مِنَ  الْمُسْلِمِينَ )."),
];

class PrayersfromtheQuran {
  String? azkar;
  PrayersfromtheQuran(this.azkar);
}

List<Adaiaminnalsannah> Sannah = [
  Adaiaminnalsannah(
      "“اللَّهُمَّ  رَبَّنَا  لَكَ  الحَمْدُ  ، أَنْتَ  قَيِّمُ  السَّمَاوَاتِ  وَالأَرْضِ  ، وَلَكَ  الحَمْدُ  أَنْتَ  رَبُّ  السَّمَاوَاتِ  وَالأَرْضِ  وَمَنْ  فِيهِنَّ  ، وَلَكَ  الحَمْدُ  ، أَنْتَ  نُورُ  السَّمَاوَاتِ  وَالأَرْضِ  وَمَنْ  فِيهِنَّ  ، أَنْتَ  الحَقُّ  ، وَقَولُكَ  الحَقُّ  ، وَوَعْدُكَ  الحَقُّ  ، وَلِقَاؤُكَ  الحَقُّ  ، وَالجَنَّةُ  حَقٌّ  ، وَالنَّارُ  حَقٌّ  ، وَالسَّاعَةُ  حَقٌّ  اللَّهُمَّ  لَكَ  أَسْلَمْتُ  ، وَبِكَ  آمَنْتُ  ، وَعَلَيكَ  تَوَكَّلْتُ  ، وَإليكَ  خَاصَمْتُ  ، وَبِكَ  حَاكَمْتُ  ، فَاغْفِرْ  لِي  مَا  قَدَّمْتُ  وَمَا  أَخَّرْتُ  ، وَأَسْرَرْتُ  وَأَعْلَنْتُ  ، وَمَا  أَنْتَ  أَعْلَمُ  بِهِ  مِنِّي  لا  إلَهَ  إلَّا  أَنْتَ ” . متفق عليه"),
  Adaiaminnalsannah(
      "“اللهم لك الحمد أنت نور السماوات والأرض ومن فيهن ولك الحمد  ، أنت قيوم السماوات والأرض ومن فيهن ولك الحمد  ، أنت الحق  ، ووعدك الحق  ، ولقاؤك حق  ، والجنة حق  ، والنار حق  ، والنبيون حق  ، والساعة حق  ، ومحمد حق  ، اللهم لك أسلمت  ، وبك آمنت  ، وعليك توكلت  ، وإليك أنبت  ، وبك خاصمت  ، وإليك حاكمت  ، فاغفر لى ما قدمت وما أخرت  ، وما أسررت وما أعلنت  ، أنت إلهى لا إله إلا أنت ” . متفق عليه"),
  Adaiaminnalsannah(
      "“اللهم إني أعوذ بك من فتنة النار وعذاب النار  ، وفتنة القبر  ، وعذاب القبر  ، وشر فتنة الغنى  ، وشر فتنة الفقر  ، اللهم إني أعوذ بك من شر فتنة المسيح الدجال  ، اللهم أغسل قلبي بماء الثلج والبرد  ، ونق قلبي من الخطايا كما نقيت الثوب الأبيض من الدنس  ، وباعد بيني وبين خطاياي كما باعدت بين المشرق والمغرب اللهم إني أعوذ بك من الكسل والمأثم والمغرم ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أعوذ بك من العجز والكسل  ، والجبن والهرم والبخل  ، وأعوذ بك من عذاب القبر  ، ومن فتنة المحيا والممات ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ  اهْدِنِي  فِيمَنْ  هَدَيْتَ  ، وَعَافِنِي  فِيمَنْ  عَافَيْتَ  ، وَتَوَلَّنِي  فِيمَنْ  تَوَلَّيْتَ  ، وَبَارِكْ  لِي  فِيمَا  أَعْطَيْتَ  ، وَقِنِي  شَرَّ  مَا  قَضَيْتَ  ، إِنَّكَ  تَقْضِي  وَلَا  يُقْضَى  عَلَيْكَ  ، وإِنَّهُ  لَا  يَذِلُّ  مَنْ  وَالَيْتَ  ، وَلاَ  يَعِزُّ  مَنْ  عَادَيْتَ  ، تَبَارَكْتَ  رَبَّنَا  وَتَعَالَيْتَ ” . أخرجه أبو داود والترمذي."),
  Adaiaminnalsannah(
      "“اللهم صل على محمد  ، وعلى آل محمد، كما صليت على إبراهيم  ، وعلى آل إبراهيم  ، إنك حميد مجيد  ، وبارك على محمد  ، وعلى آل محمد  ، كما باركت على إبراهيم  ، وعلى آل إبراهيم في العالمين إنك حميد مجيد ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أعوذ بك من الهم والحزن  ، وأعوذ بك من العجز والكسل  ، وأعوذ بك من الجبن والبخل  ، وأعوذ بك من غلبة الدين  ، وقهر الرجال ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أعوذ بك من جهد البلاء  ، ودرك الشقاء  ، وسوء القضاء، وشماتة الأعداء ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً  ، وَفِي الآخِرَةِ حَسَنَةً  ، وَقِنَا عَذَابَ النَّارِ ” ."),
  Adaiaminnalsannah(
      "“اللهم أحيني على سنة نبيك وتوفني على ملته  ، وأعذني من مضلات الفتن ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أسألك الهدى  ، والتقى  ، والعفاف  ، والغنى ” ."),
  Adaiaminnalsannah("“اللهم إني أسألك شهادة في سبيلك ” ."),
  Adaiaminnalsannah(
      "“لا إله إلا الله العظيم الحليم  ، لا إله إلا الله رب العرش العظيم  ، لا إله إلا الله رب السماوات  ، ورب الأرض  ، ورب العرش الكريم ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ أصْلِحْ لِي دِينِي الَّذِي هُوَ عِصْمَةُ أَمْرِي  ، وَأصْلِحْ لِي دُنْيَايَ الَّتِي فِيهَا مَعَاشِي  ، وَأصْلِحْ لِي آخِرَتِي الَّتِي فِيهَا مَعَادِي  ، وَاجْعَلِ الحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيرٍ  ، وَاجْعَلِ المَوتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ ” ."),
  Adaiaminnalsannah("“اللهم إني أسألك العافية في الدنيا والآخرة ” ."),
  Adaiaminnalsannah("“اللهم إنك عفو كريم تحب العفو فاعف عني ” ."),
  Adaiaminnalsannah(
      "“يتعوذ بِالله مِنْ جَهْدِ البَلاءِ  ، وَدَرَكِ الشَّقَاءِ  ، وَسُوءِ القَضَاءِ  ، وَشَمَاتَةِ الأَعْدَاءِ ” ."),
  Adaiaminnalsannah(
      "“اللهم إنا نسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم  ، ونعوذ بك من شر ما استعاذ منه نبيك محمد صلى الله عليه وسلم  ، وأنت المستعان  ، وعليك البلاغ  ، ولا حول ولا قوة إلا بالله ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ  ، وَالجُبْنِ وَالبُخْلِ  ، وَالهَرمِ وَعَذَابِ القَبْرِ  ، اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا  ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا  ، أَنْتَ وَلِيُّهَا وَمَولاهَا  ، اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ عِلْمٍ لا يَنْفَعُ  ، وَمِنْ قَلْبٍ لا يَخْشَعُ  ، وَمِنْ نَفْسٍ لا تَشْبَعُ  ، وَمِنْ دَعْوَةٍ لا يُسْتَجَابُ لَهَا ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أعوذ بك من علم لا ينفع  ، وعمل لا يرفع  ، وقلب لا يخشع  ، وقول لا يسمع ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أسألك من الخير كله  : عاجله وآجله  ، ما علمت منه وما لم أعلم  ، وأعوذ بك من الشر كله عاجله وآجله  ، ما علمت منه وما لم أعلم اللهم إني أسألك من خير ما سألك عبدك ونبيك  ، وأعوذ بك من شر ما استعاذ بك منه عبدك ونبيك اللهم إني أسألك الجنة  ، وما قرب إليها من قول أو عمل  ، وأعوذ بك من النار وما قرب إليها من قول أو عمل  ، وأسألك أن تجعل كل قضاء قضيته لي خيراً ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ اهْدِنِي وَسَدِّدْنِي  ، اللَّهُمَّ إنِّي أَسْأَلُكَ الهُدَى وَالسَّدَادَ ” ."),
  Adaiaminnalsannah(
      "“اللهم اغفر لي خطيئتي  ، وجهلي  ، وإسرافي في أمري  ، وما أنت أعلم به مني  ، اللهم أغفر لي هزلي وجدي  ، وخطئي وعمدي  ، وكل ذلك عندي ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَاعَمِلْتُ  ، وَمِنْ شَرِّ مَا لَمْ أَعْمَلْ ” ."),
  Adaiaminnalsannah("“اللهم إني أسألك المعافاة في الدنيا والآخرة ” ."),
  Adaiaminnalsannah(
      "“اللهم إنا نسألك موجبات رحمتك  ، وعزائم مغفرتك  ، والسلامة من كل إثم  ، والغنيمة من كل بر، والفوز بالجنة  ، والنجاة من النار ” ."),
  Adaiaminnalsannah("“اللهم أكثر مالي  ، وولدي  ، وبارك لي فيما أعطيتني ” ."),
  Adaiaminnalsannah(
      "“لا إلَهَ إلَّا الله العَظِيمُ الحَلِيمُ  ، لا إلَهَ إلَّا الله رَبُّ العَرْشِ العَظِيمِ  ، لا إلَهَ إلَّا الله رَبُّ السَّمَاوَاتِ  ، وَرَبُّ الأَرْضِ  ، وَرَبُّ العَرْشِ الكَرِيمِ ” ."),
  Adaiaminnalsannah(
      "”اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنَ الكَسَلِ وَالهَرَمِ  ، وَالمَغْرَمِ  ، وَالمَأْثَمِ  ، اللَّهُمَّ إنِّي أَعُوذُ بِكَ مِنْ عَذَابِ النَّارِ  ، وَفِتْنَةِ النَّارِ  ، وَفِتْنَةِ القَبْرِ  ، وَعَذَابِ القَبْرِ  ، وَشَرِّ فِتْنَةِ الغِنَى  ، وَشَرِّ فِتْنَةِ الفَقْرِ  ، وَمِنْ شَرِّ فِتْنَةِ المَسِيحِ الدَّجَّالِ اللَّهُمَّ اغْسِلْ خَطَايَايَ بِمَاءِ الثَّلْجِ وَالبَرَدِ  ، وَنَقِّ قَلْبِي مِنَ الخَطَايَا كَمَا يُنَقَّى الثَّوبُ الأَبْيَضُ مِنَ الدَّنَسِ  ، وَبَاعِدْ بَيْنِي وَبَينَ خَطَايَايَ كَمَا بَاعَدْتَ بَينَ المَشْرِقِ وَالمَغْرِبِ ” ."),
  Adaiaminnalsannah("“اللهم لا تخزني يوم القيامة ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أعوذ بك من جار السوء  ، ومن زوج تشيبني قبل المشيب  ، ومن ولد يكون علي ربا  ، ومن مال يكون علي عذابا  ، ومن خليل ماكر عينه تراني  ، وقلبه يرعاني  ؛ إن رأى حسنة دفنها  ، وإذا رأى سيئة أذاعها ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ إنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً  ، وَلا يَغْفِرُ الذُّنُوبَ إلَّا أَنْت  َ، فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ  ، وَارْحَمْنِي إنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ لَكَ أَسْلَمْتُ  ، وَبِكَ آمَنْتُ، وَعَلَيكَ تَوَكَّلْتُ  ، وَإلَيكَ أَنَبْتُ، وَبِكَ خَاصَمْتُ  ، اللَّهُمَّ إنِّي أَعُوذُ بِعِزَّتِكَ لا إلَهَ إلَّا أَنْتَ أَنْ تُضِلَّنِي  ، أَنْتَ الحَيُّ الَّذِي لا يَمُوتُ  ، وَالجِنُّ وَالإنْسُ يَمُوتُونَ ” ."),
  Adaiaminnalsannah("“اللهم إني أعوذ بك من صلاة لا تنفع ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أعوذ بك من الفقر  ، والقلة  ، والذلة  ، وأعوذ بك من أن أظلم أو أظلم ” ."),
  Adaiaminnalsannah(
      "“اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين  ، وأصلح لي شأني كله  ، لا إله إلا أنت ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ اغْفِرْ لِي خَطِيْئَتِي وَجَهْلِي  ، وَإسْرَافِي فِي أَمْرِي  ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي  ، اللَّهُمَّ اغْفِرْ لِي جِدِّيْ وَهَزْلِيْ  ، وَخَطَئِي وَعَمْدِي وَكُلُّ ذَلِكَ عِنْدِي اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْت  ُ، وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ  ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي  ، أَنْتَ المُقَدِّمُ وَأَنْتَ المُؤَخِّرُ  ، وَأَنْتَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ” ."),
  Adaiaminnalsannah("“اللهم إني أسألك الفردوس أعلى الجنة ” ."),
  Adaiaminnalsannah("“اللهم جدد الإيمان في قلبي ” ."),
  Adaiaminnalsannah(
      "“اللهم إني أسألك الثبات في الأمر  ، والعزيمة على الرشد  ، وأسألك موجبات رحمتك  ، وعزائم مغفرتك  ، وأسألك شكر نعمتك  ، وحسن عبادتك  ، وأسألك قلبا سليما  ، ولسانا صادقا  ، وأسألك من خير ما تعلم  ، وأعوذ بك من شر ما تعلم  ، وأستغفرك لما تعلم  ، إنك أنت علام الغيوب ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ إنِّي عَبْدُكَ وابْنُ عَبْدِكَ وَابْنُ أَمَتِكَ  ، نَاصِيَتِي بِيَدِكَ  ، مَاضٍ فِيَّ حُكْمُكَ  ، عَدْلٌ فِيَّ قَضَاؤُكَ  ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ  ، سَمَّيْتَ بِهِ نَفْسَكَ  ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ  ، أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَكَ  ، أَنْ تَجْعَلَ القُرآنَ رَبِيعَ قَلْبِي  ، وَنُورَ صَدْرِي  ، وَجَلاءَ حُزنِي  ، وَذَهَابَ هَمِّي ” ."),
  Adaiaminnalsannah("“اللهم ثبتني واجعلني هاديا مهديا ” ."),
  Adaiaminnalsannah("“اللهم أحسنت خلقي فأحسن خلقي ” ."),
  Adaiaminnalsannah(
      "“اللَّهُمَّ إنِّي أَسْأَلُكَ مِنَ الخَيرِ كُلِّه  ، عَاجِلِهِ وَآجِلِهِ  ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ  ، وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ  ، عَاجِلِهِ وَآجِلِهِ  ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ  ، اللَّهُمَّ إنِّي أَسْأَلُكَ مِنْ خَيرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ  ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ بِهِ عَبْدُكَ وَنَبِيُّكَ  ، اللَّهُمَّ إنِّي أَسْأَلُكَ الجَنَّةَ ومَا قَرَّبَ إلَيْهَا مِنْ قَولٍ أَوْ عَمَلٍ  ، وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إلَيْهَا مِنْ قَولٍ أَوْ عَمَلٍ  ، وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ قَضَيْتَهُ لِي خَيْراً ” .")
];

class Adaiaminnalsannah {
  String? azkar;
  Adaiaminnalsannah(this.azkar);
}

List<Remembering_after_prayer> prayer = [
  Remembering_after_prayer(
      "الاستغفار ثلاثًا؛ فالمسلم لا يخلو من تقصيره في الصلاة  ، ثمّ يردّد الدّعاء  : «اللهُمّ أنت السلام  ، ومنك السلام  ، تباركت يا ذا الجلال والإكرام»  ، حيث جاء في صحيح مسلم عن ثوبان مولى رسول الله صلى الله عليه وسلم  : «كان رسولُ اللهِ -صلَّى اللهُ عليه وسلَّمَ- إذا انصرف من صلاتِه  ، استغفر ثلاثًا، وقال  : اللهمَّ أنت السلامُ ومنك السلامُ  ، تباركت يا ذا الجلالِ والإكرامِ » ."),
  Remembering_after_prayer(
      "قول دُعاء  : «لا إله إلّا الله  ، وحده لا شريك له  ، له الملك وله الحمد  ، وهو على كل شيء قدير  ، اللهم لا مانع لما أعطيت  ، ولا معطي لما منعت  ، ولا ينفع ذا الجدّ منك الجدّ »  ،\n فعن المغيرة بن شعبة أنّه قال  : «إنَّ رسولَ اللهِ -صلَّى اللهُ عليه وسلَّمَ- كان إذا فرغ من الصلاةِ وسلَّمَ  ، قال  : لا إله إلا الله وحده لا شريك له له الملكُ وله الحمدُ وهو على كل شيءٍ قديرٌ  ، اللهمَّ لا مانعَ لما أعطيتَ ولا مُعطيَ لما منعتَ  ، ولا ينفعُ ذا الجدِّ منك الجَدُّ » ."),
  Remembering_after_prayer(
      "الدُّعاء بقول  : «لا إله إلا الله وحده لا شريك له  ، له الملك وله الحمد وهو على كل شيء قدير  ، لا حول ولا قوة إلا بالله  ، لا إله إلا الله ولا نعبد إلا إياه  ، له النعمة وله الفضل وله الثناء الحسَن  ، لا إله إلا الله مخلصين له الدين ولو كرِه الكافرون »  ، فقد جاء في صحيح مسلم عن عبد الله بن الزبير رضي الله عنه  : «لا إله إلا اللهُ وحده لا شريك له  ، له الملكُ وله الحمدُ وهو على كلِّ شيءٍ قدير  ، لا حول ولا قوةَ إلا بالله  ، لا إله إلا اللهُ  ، ولا نعبد إلا إياه  ، له النعمةُ وله الفضلُ  ، وله الثناءُ الحسنُ  ، لا إله إلا اللهُ مُخلصين له الدينَ ولو كره الكافرون » ."),
  Remembering_after_prayer(
      " التسبيح ثلاثًا وثلاثين مّرًة  ،\n والتحميد ثلاثًا وثلاثين مرّةً  ، \n والتكبير ثلاثًا وثلاثين مرّةً  ، \n جاء عن الرسول -صلّى الله عليه وسلم- أنّه قال  : «أفلا أُعلِّمكم شيئًا تُدركون به مَن سبقَكم وتَسبقون به من بعدكم  ، ولا يكون أحدٌ أفضل منكم إلا من صنع مثلَ ما صنعتُم  ؟ قالوا  : بَلى يا رَسولَ الله  ، قال  : تُسبِّحونَ وَتُكَبِّرُونَ وَتُحَمِّدونَ دُبُرَ كلِّ صلاةٍ ثلاثًا وثلاثين مرّةً » ."),
  Remembering_after_prayer(
      "قول دعاء  : «اللهم إنّي أعوذ بك من الجُبن  ، وأعوذ بك أن أُرَدَّ إلى أرذل العُمر  ، وأعوذ بك من فتنة الدنيا  ، وأعوذ بك من عذاب القبر »  ، \n فقد جاء في صحيح البخاري  : «كان سَعْدٌ يَأمُرُ بخَمسٍ  ، ويَذْكُرُهُنَّ عَنِ النبيِّ -صلَّى اللهُ عليه وسلَّم- أنّه كان يأمُرُ بهِنَ  ّ: اللَّهُمَّ إني أعوذُ بكَ مِنَ البُخلِ  ، وأعوذُ بِكَ مِنَ الجُبنِ  ، وأعوذُ بِكَ أنْ أُرَدَّ إلى أرْذَلِ العُمُرِ  ، وأعوذُ بِكَ مِن فِتنَةِ الدُّنْيا -يَعني فِتنَةَ الدَّجَّالِ- وأعوذُ بِكَ مِن عَذابِ القَبرِ » ."),
  Remembering_after_prayer(
      "قراءة المعوِّذتين  ، وهما سورتا الفلق والناس  ،\n حيث قال عقبة بن عامر  : «أمرني رسولُ اللهِ -صلَّى اللهُ عليه وسلّم- أنْ أقرأ بالمعوِّذتينِ في دبُرِ كلِّ صلاةٍ » ."),
  Remembering_after_prayer(
      "ترديد دُعاء  : «اللهُمّ أعنّي على ذِكرك  ، وشُكرك  ، وحُسن عبادتك »  ،\n فعن معاذ بن جبل -رضي الله عنه- قال  : «أخذَ رسولَ اللَّهِ -صلَّى اللَّهُ عليهِ وسلَّمَ- بيدي يومًا  ، فقالَ: يا معاذُ إنِّي واللَّهِ لأحبُّك \n فقالَ معاذٌ  : بأبي أنتَ وأمِّي يا رسولَ اللَّهِ  ، وأنا واللَّهِ أحبُّكَ  ، فقالَ  : أوصيكَ يا معاذُ لا تدَعَنَّ دُبرَ كلِّ صلاةٍ مكتوبةٍ أن تقولَ  : اللَّهمَّ أعنِّي على ذِكرِكَ  ، وشُكرِكَ  ، وحُسنِ عبادتِكَ » ."),
  Remembering_after_prayer(
      "قول المسلم  : «اللهُمّ اغفر لي ذنوبي وخطاياي كلَّها  ، اللهم أنعشني واجبُرني واهدِني لصالح الأعمال والأخلاق  ، فإنّه لا يهدي لصالحها ولا يصرف سيِّئها إلا أنت » ، فقد رُوي عن أبي أمامة الباهلي  : «اللهُمّ اغفِر لي ذنوبي وخطايايَ كلَّها  ، اللهم أَنعِشْني واجبُرْني  ، واهدِني لصالحِ الأعمالِ والأخلاقِ  ؛ فإنّه لا يهدي لصالحها ولا يصرفُ سيِّئَها إلا أنت » ."),
  Remembering_after_prayer(
      "ذِكر دعاء  : «اللهم إنّي أعوذ بك من الكُفر  ، والفقر  ، وعذاب القبر »  ،\n حيث رُوِي عن أنس بن مالك رضي الله عنه  : «أنَّ رسولَ اللهِ -صلَّى اللهُ عليه وسلَّمَ- كان يقولُ  : اللهمَّ إنّي أعوذُ بك من الكفرِ  ، والفقرِ  ، وعذابِ القبر » ."),
  Remembering_after_prayer(
      "الصّلاة على النبيّ صلّى الله عليه وسلم  ، والتوجّه بالدعاء إلى الله تعالى  ، \n جاء في السُّنة النبويّة  : «سمِع -صلَّى اللهُ عليه وسلم- رجلًا يدعو في صلاتهِ لَم يُمجِّدِ اللهَ تعالَى  ، ولم يصلِّ على النبيِّ صلَّى اللهُ عليه وسلم  ، فقال  : عجِلَ هذا  ، ثمَّ دعاهُ فقال له أو لغيرِه  : إذا صلَّى أحدُكم فليبدأْ  ، بتحميدِ ربِّه جلَّ وعزَّ  ، والثناءِ عليه  ، ثمَّ يصلِّي  ، وفي روايةٍ  : ليصلِّ على النبيِّ صلَّى اللهُ عليه وسلم، ثمَّ يدعو بعدُ بما شاء  ، وسمِع رسولُ اللهِ -صلَّى اللهُ عليه وسلم- رجلًا يصلِّي، فمجَّد اللهَ وحمِدَه  ، وصلَّى على النبيِّ صلَّى اللهُ عليه وسلم، فقال رسولُ اللهِ صلَّى اللهُ عليه وسلم  : ادعُ تُجَبْ، وسَلْ تُعطَ » ."),
  Remembering_after_prayer(
      "« رَبِّ  اجْعَلْنِي  مُقِيمَ  الصَّلَاةِ  وَمِن  ذُرِّيَّتِي ۚ  رَبَّنَا  وَتَقَبَّلْ دُعَاءِ » ."),
  Remembering_after_prayer(
      "« قَالَ  رَبِّ  اشْرَحْ  لِي  صَدْرِي * وَيَسِّرْ  لِي  أَمْرِي » ."),
  Remembering_after_prayer("« رَّبِّ  زِدْنِي  عِلْمًا » ."),
  Remembering_after_prayer(
      "«لَّا  إِلَٰهَ  إِلَّا  أَنتَ  سُبْحَانَكَ  إِنِّي  كُنتُ  مِنَ  الظَّالِمِينَ » ."),
  Remembering_after_prayer(
      "« رَّبِّ  أَنزِلْنِي  مُنزَلًا  مُّبَارَكًا  وَأَنتَ  خَيْرُ  الْمُنزِلِينَ » ."),
  Remembering_after_prayer(
      " « رَبِّ  هَبْ  لِي  حُكْمًا  وَأَلْحِقْنِي  بِالصَّالِحِينَ » ."),
  Remembering_after_prayer(
      "« رَبَّنَا  هَبْ لَنَا  مِنْ  أَزْوَاجِنَا  وَذُرِّيَّاتِنَا  قُرَّةَ  أَعْيُنٍ  وَاجْعَلْنَا  لِلْمُتَّقِينَ  إِمَامًا » ."),
  Remembering_after_prayer(
      "« وَتُبْ  عَلَيْنَا  إِنَّكَ أَنْتَ  التَّوَّابُ  الرَّحِيمُ » ."),
  Remembering_after_prayer(
      "« رَبَّنَا  تَقَبَّلْ  مِنَّا  إِنَّكَ  أَنْتَ  السَّمِيعُ  الْعَلِيمُ » ."),
  Remembering_after_prayer(
      "« رَبَّنَا  آتِنَا  فِي  الدُّنْيَا  حَسَنَةً  وَفِي  الْآخِرَةِ  حَسَنَةً  وَقِنَا  عَذَابَ  النَّارِ» ."),
  Remembering_after_prayer(
      "« رَبَّنَا  لَا  تُؤَاخِذْنَا  إِن  نَّسِينَا  أَوْ  أَخْطَأْنَا ۚ  رَبَّنَا  وَلَا  تَحْمِلْ  عَلَيْنَا  إِصْرًا  كَمَا  حَمَلْتَهُ  عَلَى  الَّذِينَ  مِن  قَبْلِنَا ۚ  رَبَّنَا  وَلَا  تُحَمِّلْنَا  مَا  لَا  طَاقَةَ  لَنَا  بِهِ ۖ  وَاعْفُ  عَنَّا  وَاغْفِرْ  لَنَا  وَارْحَمْنَا ۚ » ."),
  Remembering_after_prayer(
      "« رَبَّنَا  لَا  تُزِغْ  قُلُوبَنَا  بَعْدَ  إِذْ  هَدَيْتَنَا  وَهَبْ  لَنَا  مِن  لَّدُنكَ  رَحْمَةً  ۚ» ."),
  Remembering_after_prayer(
      "« رَبِّ  هَبْ  لِي  مِن  لَّدُنكَ  ذُرِّيَّةً  طَيِّبَةً ۖ  إِنَّكَ  سَمِيعُ  الدُّعَاءِ » ."),
  Remembering_after_prayer(
      "«رَبَّنَا  آتِنَا  مِن  لَّدُنكَ  رَحْمَةً  وَهَيِّئْ  لَنَا  مِنْ  أَمْرِنَا  رَشَدًا » ."),
  Remembering_after_prayer(
      "« رَبِّ  أَوْزِعْنِي  أَنْ  أَشْكُرَ  نِعْمَتَكَ  الَّتِي  أَنْعَمْتَ  عَلَيَّ  وَعَلَىٰ  وَالِدَيَّ  وَأَنْ  أَعْمَلَ  صَالِحًا  تَرْضَاهُ  وَأَدْخِلْنِي  بِرَحْمَتِكَ  فِي  عِبَادِكَ  الصَّالِحِينَ » ."),
];

class Remembering_after_prayer {
  String? azkar;
  Remembering_after_prayer(this.azkar);
}

List<Tsabeh> Tsabeh1 = [
  Tsabeh("«  مئة  مرة  لكل  منهما  »"),
  Tsabeh(" سُبْحَانَ  اللَّهِ "),
  Tsabeh(" سُبْحَانَ  اللَّهِ  وَبِحَمْدِهِ "),
  Tsabeh(" سُبْحَانَ  اللَّهِ  وَالْحَمْدُ  لِلَّهِ "),
  Tsabeh(" سُبْحَانَ  اللهِ  العَظِيمِ  وَبِحَمْدِهِ "),
  Tsabeh(" سُبْحَانَ  اللَّهِ  وَبِحَمْدِهِ ، سُبْحَانَ  اللَّهِ  الْعَظِيمِ "),
  Tsabeh(
      " لَا  إلَه  إلّا  اللهُ  وَحْدَهُ  لَا  شَرِيكَ  لَهُ  ، لَهُ  الْمُلْكُ  وَلَهُ  الْحَمْدُ  وَهُوَ  عَلَى  كُلُّ  شَيْءِ  قَدِيرِ "),
  Tsabeh(" الْحَمْدُ للّهِ رَبِّ  الْعَالَمِينَ "),
  Tsabeh(" لا  حَوْلَ  وَلا  قُوَّةَ  إِلا  بِاللَّهِ "),
  Tsabeh(" الْلَّهُم  صَلِّ  وَسَلِم  وَبَارِك  عَلَى  سَيِّدِنَا  مُحَمَّد "),
  Tsabeh(" أستغفر  الله "),
  Tsabeh(
      " سُبْحَانَ  الْلَّهِ  ، وَالْحَمْدُ  لِلَّهِ  ، وَلَا  إِلَهَ  إِلَّا  الْلَّهُ  ، وَالْلَّهُ  أَكْبَرُ "),
  Tsabeh(" لَا  إِلَهَ  إِلَّا  اللَّهُ "),
  Tsabeh(" الْلَّهُ أَكْبَرُ "),
  Tsabeh(
      " سُبْحَانَ  اللَّهِ  ، وَالْحَمْدُ  لِلَّهِ  ، وَلا  إِلَهَ  إِلا  اللَّهُ  ، وَاللَّهُ  أَكْبَرُ  ، اللَّهُمَّ  اغْفِرْ  لِي  ، اللَّهُمَّ  ارْحَمْنِي  ، اللَّهُمَّ  ارْزُقْنِي "),
  Tsabeh(
      " الْحَمْدُ  لِلَّهِ  حَمْدًا  كَثِيرًا  طَيِّبًا  مُبَارَكًا  فِيهِ "),
  Tsabeh(
      " اللَّهُ  أَكْبَرُ  كَبِيرًا  ، وَالْحَمْدُ  لِلَّهِ  كَثِيرًا  ، وَسُبْحَانَ  اللَّهِ  بُكْرَةً  وَأَصِيلاً "),
  Tsabeh(
      " اللَّهُمَّ  صَلِّ  عَلَى  مُحَمَّدٍ  وَعَلَى  آلِ  مُحَمَّدٍ  كَمَا  صَلَّيْتَ  عَلَى  إِبْرَاهِيمَ  , وَعَلَى  آلِ  إِبْرَاهِيمَ  إِنَّكَ  حَمِيدٌ  مَجِيدٌ ")
];

class Tsabeh {
  String? tsabeh;
  Tsabeh(this.tsabeh);
}

List<Quran> qur = [
  Quran(
      "صفاء الذهن، حيث يسترسل المسلم بشكل يومي مع القرآن الكريم  ، فيتتبع آياته وأحكامه  ، وعظمة الله في خلقه ."),
  Quran(
      "قوَّة الذاكرة؛ فخير ما تنتظم به ذاكرة المسلم هو آيات القرآن الكريم، تأملًا  ، وحفظًا  ، وتدبرًا ."),
  Quran(
      "طمأنينة القلب  ، حيث يعيش من يحافظ على تلاوة القرآن الكريم وحفظ آياته بطمأنينة عجيبة  ، يقوى من خلالها على مواجهة الصعاب التي تواجهه  ، \n فقد قال– تعالى-  : «الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ » ، ( سورة الرعد: الأية 28) ."),
  Quran(
      "الشعور بالفرح والسعادة  ، وهي ثمرة أصيلة لتعلُّق قلب المسلم بخالقه  ، بترديده لآياته وتعظيمه له ."),
  Quran(
      "الشعور بالشجاعة وقوَّة النفس  ، والتخلُّص من الخوف والحزن والتوتر والقلق ."),
  Quran(
      "قراءة القران الكريم قوة في اللغة  ، فالذي يعيش مع آيات القرآن  ، وما فيها من بلاغة محكمة  ، وبيان عذب  ، ولغة قوية  ، تقوى بذلك لغته  ، وتثرى مفرداته  ، ولا سيَّما متى عاش مع القرآن متدبرًا لمعانيه ."),
  Quran(
      "انتظام علاقات قارئ القرآن الاجتماعيَّة مع النَّاس من حوله  ، حيث ينعكس نور القرآن على سلوكه  ، قولًا وعملًا فيحبب الناس به ويشجعهم على بناء علاقات تواصليَّة معه  ، فيألف بهم  ، ويألفون به ."),
  Quran(
      "التخلُّص من الأمراض المزمنة  ، حيث ثبت علميًا أنَّ المحافظة على تلاوة القرآن الكريم والاستماع لآياته  ، يقوي المناعة لدى الإنسان بما يمكِّنه من مواجهة الكثير من الأمراض المزمنة ."),
  Quran(
      " رفع لقدرة الإنسان الإدراكيَّة في مجال الفهم والاستيعاب، فالمسلم المنتظم بعلاقته مع كتاب الله دائم البحث والتدبر في معانيه  ، مقلبًا لكتب التفسير يتعلم كل ما هو جديد من معاني القرآن العظيمة ."),
  Quran(
      "نيل رضى الله وتوفيقه له في شؤون الدنيا  ، يجده بركة في الرزق  ، ونجاة من المكروه  .\n الفوز بالجنَّة يوم القيامة  ، حيث يأتي القرآن الكريم يوم القيامة يحاجّ عن صاحبه الذي كان يقرؤه  ، شفيعًا له ."),
  Quran(
      "استحقاق شفاعة القرآن لصاحبه يوم القيامة  : لقوله - صلى الله عليه وسلم-  : « اقْرَؤوا القرآنَ فإنه يأتي يومَ القيامةِ شفيعًا لأصحابه »  ، صحيح مسلم ."),
  Quran(
      "قارىء القرآن له بكل حرف عشر حسنات: لقول رسول الله – صلى الله عليه وسلم-: «من قرأ حرفًا من كتابِ اللهِ فله به حسنةٌ، والحسنةُ بعشرِ أمثالِها لا أقولُ ( الـم )  حرفٌ  ولكنْ  ( ألفٌ  )  حرفٌ  و( لامٌ  )  حرفٌ  و( ميمٌ  ) حرفٌ » ، حديثُ  حسن ."),
  Quran(
      "يستحق صاحبه علو الدرجات في الجنة  : قال - صلى الله عليه وسلم-  : «يقالُ لصاحبِ القرآنِ  : اقرأْ وارتقِ  ، ورتِّلْ كما كنتَ ترتِّلُ في الدنيا  ، فإنَّ منزلَكَ عند آخرِ آيةٍ تقرؤُها » ، إسناده حسن ."),
  Quran(
      "تشفي الإنسان من الحيرة التي تصيبه  ، كما أنّ قراءته تبعد عن اليأس والإحباط ."),
  Quran(
      "يبين المساواة بين الرجل والمرأة في التكليف  ، والتشريف  ، والمسؤولية ."),
  Quran("يبعد الإنسان عن الخوف  ، والخرافات  ، والأوهام ."),
  Quran("يقدم تفسيرًا دقيقًا للحياة ، والكون ، والإنسان ."),
  Quran("يبعد الإنسان عن جميع انواع الشبهات ."),
  Quran("يلقي في قلب القارئ الطمأنينة والسكينة .")
];

class Quran {
  String? qur;
  Quran(this.qur);
}

List<DuaaahEndalQaran> DuaaahEndal = [
  DuaaahEndalQaran(
      "اللَّهُمَّ  ارْحَمْنِي  بالقُرْءَانِ  وَاجْعَلهُ  لِي  إِمَاماً  وَنُوراً  وَهُدًى  وَرَحْمَةً "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  ذَكِّرْنِي  مِنْهُ  مَانَسِيتُ  وَعَلِّمْنِي  مِنْهُ  مَاجَهِلْتُ  وَارْزُقْنِي  تِلاَوَتَهُ  آنَاءَ  اللَّيْلِ  وَأَطْرَافَ  النَّهَارِ  وَاجْعَلْهُ  لِي  حُجَّةً  يَارَبَّ  العَالَمِينَ "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  أَصْلِحْ  لِي  دِينِي  الَّذِي  هُوَ  عِصْمَةُ  أَمْرِي  ، وَأَصْلِحْ  لِي  دُنْيَايَ  الَّتِي  فِيهَا  مَعَاشِي  ، وَأَصْلِحْ  لِي  آخِرَتِي  الَّتِي  فِيهَا  مَعَادِي  ، وَاجْعَلِ  الحَيَاةَ  زِيَادَةً  لِي  فِي  كُلِّ  خَيْرٍ  وَاجْعَلِ  المَوْتَ  رَاحَةً  لِي  مِنْ  كُلِّ  شَرٍّ "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  اجْعَلْ  خَيْرَ  عُمْرِي  آخِرَهُ  وَخَيْرَ  عَمَلِي  خَوَاتِمَهُ  وَخَيْرَ  أَيَّامِي  يَوْمَ  أَلْقَاكَ  فِيهِ "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  إِنِّي  أَسْأَلُكَ  عِيشَةً  هَنِيَّةً  وَمِيتَةً  سَوِيَّةً  وَمَرَدًّا  غَيْرَ  مُخْزٍ  وَلاَ  فَاضِحٍ "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  إِنِّي  أَسْأَلُكَ  خَيْرَ  المَسْأَلةِ  وَخَيْرَ  الدُّعَاءِ  وَخَيْرَ  النَّجَاحِ  وَخَيْرَ  العِلْمِ  وَخَيْرَ  العَمَلِ  وَخَيْرَ  الثَّوَابِ  وَخَيْرَ  الحَيَاةِ  وَخيْرَ  المَمَاتِ  وَثَبِّتْنِي  وَثَقِّلْ  مَوَازِينِي  وَحَقِّقْ  إِيمَانِي  وَارْفَعْ  دَرَجَتِي  وَتَقَبَّلْ  صَلاَتِي  وَاغْفِرْ  خَطِيئَاتِي  وَأَسْأَلُكَ  العُلَا  مِنَ  الجَنَّةِ "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  إِنِّي  أَسْأَلُكَ  مُوجِبَاتِ  رَحْمَتِكَ  وَعَزَائِمِ  مَغْفِرَتِكَ  وَالسَّلاَمَةَ  مِنْ  كُلِّ  إِثْمٍ  وَالغَنِيمَةَ  مِنْ  كُلِّ  بِرٍّ  وَالفَوْزَ  بِالجَنَّةِ  وَالنَّجَاةَ  مِنَ  النَّارِ "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  أَحْسِنْ  عَاقِبَتَنَا  فِي  الأُمُورِ  كُلِّهَا  ، وَأجِرْنَا  مِنْ  خِزْيِ  الدُّنْيَا  وَعَذَابِ  الآخِرَةِ "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  اقْسِمْ  لَنَا  مِنْ  خَشْيَتِكَ  مَاتَحُولُ  بِهِ  بَيْنَنَا  وَبَيْنَ  مَعْصِيَتِكَ  وَمِنْ  طَاعَتِكَ  مَاتُبَلِّغُنَا  بِهَا  جَنَّتَكَ  وَمِنَ  اليَقِينِ  مَاتُهَوِّنُ  بِهِ  عَلَيْنَا  مَصَائِبَ  الدُّنْيَا  وَمَتِّعْنَا  بِأَسْمَاعِنَا  وَأَبْصَارِنَا  وَقُوَّتِنَا  مَاأَحْيَيْتَنَا  وَاجْعَلْهُ  الوَارِثَ  مِنَّا  وَاجْعَلْ  ثَأْرَنَا  عَلَى  مَنْ  ظَلَمَنَا  وَانْصُرْنَا  عَلَى  مَنْ  عَادَانَا  وَلاَ  تجْعَلْ  مُصِيبَتَنَا  فِي  دِينِنَا  وَلاَ  تَجْعَلِ  الدُّنْيَا  أَكْبَرَ  هَمِّنَا  وَلَا  مَبْلَغَ  عِلْمِنَا  وَلاَ  تُسَلِّطْ  عَلَيْنَا  مَنْ  لَا  يَرْحَمُنَا "),
  DuaaahEndalQaran(
      "اللَّهُمَّ  لَا  تَدَعْ  لَنَا  ذَنْبًا  إِلَّا  غَفَرْتَهُ  وَلَا  هَمَّا  إِلَّا  فَرَّجْتَهُ  وَلَا  دَيْنًا  إِلَّا  قَضَيْتَهُ  وَلَا  حَاجَةً  مِنْ  حَوَائِجِ  الدُّنْيَا  وَالآخِرَةِ  إِلَّا  قَضَيْتَهَا  يَا أَرْحَمَ  الرَّاحِمِينَ "),
  DuaaahEndalQaran(
      "رَبَّنَا  آتِنَا  فِي  الدُّنْيَا  حَسَنَةً  وَفِي  الآخِرَةِ  حَسَنَةً  وَقِنَا  عَذَابَ  النَّارِ  وَصَلَّى  اللهُ  عَلَى  سَيِّدِنَا  وَنَبِيِّنَا  مُحَمَّدٍ  وَعَلَى  آلِهِ  وَأَصْحَابِهِ  الأَخْيَارِ  وَسَلَّمَ  تَسْلِيمًا  كَثِيراً ")
];

class DuaaahEndalQaran {
  String? qur2;
  DuaaahEndalQaran(this.qur2);
}
